heatExchanger/all_auto/case_20_10/constant/fluid/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/fluid/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet_fluid
    {
        type            patch;
        nFaces          35;
        startFace       19516;
    }
    outlet_fluid
    {
        type            patch;
        nFaces          26;
        startFace       19551;
    }
    walls_fluid
    {
        type            patch;
        nFaces          1341;
        startFace       19577;
    }
    fluid_to_fins
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          946;
        startFace       20918;
        sampleMode      nearestPatchFace;
        sampleRegion    fins;
        samplePatch     fins_to_fluid;
    }
)

// ************************************************************************* //
