heatExchanger/all_auto/case_20_10/constant/heater/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       polyBoundaryMesh;
    location    "constant/heater/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

2
(
    walls_heater
    {
        type            patch;
        nFaces          208;
        startFace       1170;
    }
    heater_to_fins
    {
        type            mappedWall;
        inGroups        List<word> 1(wall);
        nFaces          56;
        startFace       1378;
        sampleMode      nearestPatchFace;
        sampleRegion    fins;
        samplePatch     fins_to_heater;
    }
)

// ************************************************************************* //
